tutorial/introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Welcome</title>
<!-- 2015-11-11 Wed 21:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Howard Abrams" />
</head>
<body>
<div id="content">
<h1 class="title">Welcome</h1>
<p>
<b>What is this?</b>
</p>

<p>
What you see here is a <i>simulator</i> of how a computer works at its
core.
</p>

<p>
<b>Why is this Important?</b>
</p>

<p>
How does the computer in your phone work? Did you know your phone has
a computer? Your phone has more computing power than the computers we
used to get astronauts on the Moon!
</p>

<p>
Strip away the icons and other layers, and you'll find a simpler <b>core</b>.
When I was a kid, we programmed the computer's core, but now that core
is inaccessible.
</p>

<p>
So I built a <i>simulator</i> that pretends to be one of these early
computer cores (called a <i>central processing unit</i>).
</p>

<p>
<b>How do I learn?</b>
</p>

<p>
Each section can be opened by clicking on its header below. Like a
book, you will only see one section at a time. Clicking on darker words,
<a href="sub-sample.html">like these</a>, will give you background and interesting stories.
</p>

<p>
Each section has code that you can copy and paste into the simulator
on the other side of the screen. The "bar" between can be moved if you
want either the simulator or this tutorial larger.
</p>

<p>
Sounds interesting? Click to open the next section!
</p>

<blockquote>
<p>
<b>Technical Note:</b> The simulator roughly behaves like early 8-bit
 CPUs from the 1970s, like <a href="sub-6502.html">the 6502</a> (hence the reason why this system
 resembles the original Apple ][ computer). It is <i>not</i> a full
 representation (at least, not yet), as I felt it was more important
 to be easier and simpler.
</p>

<p>
If you are interested in learning the 6502 assembly language,
check out <a href="http://skilldrick.github.io/easy6502/">Nick Morgan's Online Emulator</a>.
</p>

<p>
If you are interested in expanding this project, it is all open
source located at <a href="http://github.com/howardabrams/flora-simulator">http://github.com/howardabrams/flora-simulator</a>
and the <a href="https://github.com/howardabrams/flora-simulator/blob/master/ada.coffee">computer emulator</a> is written in a language called <a href="http://www.coffeescript.org">CoffeeScript</a>.
</p>
</blockquote>
</div>
</body>
</html>
